<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CategoriesSeeder extends Seeder
{


    public function __construct()
    {
//        $this->categoriesNumberToInsert = DatabaseSeeder::$categoriesNumberToInsert ?? 10;
//        $this->currentId = DB::table('categories')->max('id') + 1 ?? 1;
    }

    public function run(): void
    {
        $categoriesData = [
            ['id' => 1, 'name' => 'Hовое'],
            ['id' => 2, 'name' => 'SALE'],
            ['id' => 3, 'name' => 'Атлас'],
            ['id' => 4, 'name' => 'Бархат'],
            ['id' => 5, 'name' => 'Бифлекс'],
            ['id' => 6, 'name' => 'Вельвет'],
            ['id' => 7, 'name' => 'Водоотталкивающие'],
            ['id' => 8, 'name' => 'Гипоаллергенные'],
            ['id' => 9, 'name' => 'Джинсовая ткань'],
            ['id' => 10, 'name' => 'Для бальных танцев'],
            ['id' => 11, 'name' => 'Для блузок'],
            ['id' => 12, 'name' => 'Для верхней одежды'],
            ['id' => 13, 'name' => 'Для военной формы'],
            ['id' => 14, 'name' => 'Для детской одежды'],
            ['id' => 15, 'name' => 'Для жилетов'],
            ['id' => 16, 'name' => 'Для карнавальных костюмов'],
            ['id' => 17, 'name' => 'Для костюмов'],
            ['id' => 18, 'name' => 'Для курток'],
            ['id' => 19, 'name' => 'Для мужских костюмов'],
            ['id' => 20, 'name' => 'Для пальто'],
            ['id' => 21, 'name' => 'Для пиджаков'],
            ['id' => 22, 'name' => 'Для платков и бандан'],
            ['id' => 23, 'name' => 'Для платьев'],
            ['id' => 24, 'name' => 'Для рубашек'],
            ['id' => 25, 'name' => 'Для сорочек и пижам'],
            ['id' => 26, 'name' => 'Для спортивной одежды'],
            ['id' => 27, 'name' => 'Для школьной формы'],
            ['id' => 28, 'name' => 'Для шуб'],
            ['id' => 29, 'name' => 'Для юбок'],
            ['id' => 30, 'name' => 'Замш'],
            ['id' => 31, 'name' => 'КРЕП ТКАНЬ'],
            ['id' => 32, 'name' => 'Кашемир'],
            ['id' => 33, 'name' => 'Костюм'],
            ['id' => 34, 'name' => 'Костюмная ткань'],
            ['id' => 35, 'name' => 'Кружево'],
            ['id' => 36, 'name' => 'Лён'],
            ['id' => 37, 'name' => 'НАТУРАЛЬНЫЕ'],
            ['id' => 38, 'name' => 'Органза купить'],
            ['id' => 39, 'name' => 'Пайетки'],
            ['id' => 40, 'name' => 'Пальтовая'],
            ['id' => 41, 'name' => 'Плиссированная ткань'],
            ['id' => 42, 'name' => 'Подкладочная ткань'],
            ['id' => 43, 'name' => 'Премиум'],
            ['id' => 44, 'name' => 'Пуховик'],
            ['id' => 45, 'name' => 'Рубашка Платье Блуза'],
            ['id' => 46, 'name' => 'Свадебная ткань'],
            ['id' => 47, 'name' => 'Светоотражающие'],
            ['id' => 48, 'name' => 'Сетка спорт, Неопрен'],
            ['id' => 49, 'name' => 'Сетка стрейч'],
            ['id' => 50, 'name' => 'Синтетическая ткань'],
            ['id' => 51, 'name' => 'Тенсел'],
            ['id' => 52, 'name' => 'Ткани для брюк'],
            ['id' => 53, 'name' => 'Ткани для вечерних платьев'],
            ['id' => 54, 'name' => 'Ткани для декора'],
            ['id' => 55, 'name' => 'Ткани для жакетов'],
            ['id' => 56, 'name' => 'Ткани для зимней одежды'],
            ['id' => 57, 'name' => 'Ткани для купальников'],
            ['id' => 58, 'name' => 'Ткани для лосин и леггинсов'],
            ['id' => 59, 'name' => 'Ткани для нижнего белья'],
            ['id' => 60, 'name' => 'Ткани для одежды'],
            ['id' => 61, 'name' => 'Ткани для плащевок (плащей)'],
            ['id' => 62, 'name' => 'Ткани для принтования'],
            ['id' => 63, 'name' => 'Ткани для фартуков'],
            ['id' => 64, 'name' => 'Ткани для футболок'],
            ['id' => 65, 'name' => 'Ткани для шарфа'],
            ['id' => 66, 'name' => 'Ткани для штанов'],
            ['id' => 67, 'name' => 'Ткань вискоза'],
            ['id' => 68, 'name' => 'Ткань для пижам'],
            ['id' => 69, 'name' => 'Ткань для плиссирования'],
            ['id' => 70, 'name' => 'Ткань плащевка'],
            ['id' => 71, 'name' => 'Ткань штапель'],
            ['id' => 72, 'name' => 'Трикотаж'],
            ['id' => 73, 'name' => 'ФАТИН'],
            ['id' => 74, 'name' => 'Хай-тек'],
            ['id' => 75, 'name' => 'Шелк'],
            ['id' => 76, 'name' => 'Шифон'],
            ['id' => 77, 'name' => 'Шубы'],
            ['id' => 78, 'name' => 'Эко-кожа'],
            ['id' => 79, 'name' => 'Эко-мех купить'],

        ];


        foreach ($categoriesData as $cat) {

            // print($country['name']) . PHP_EOL;
            // print($country['id']) . PHP_EOL;
            // die();


            try {
                DB::table('categories')->insert(
                    [
                        'id' => $cat['id'],
                        'name' => $cat['name'],
                        'created_at' => now(),
                        'updated_at' => now(),
                    ]
                );
            } catch (Exception $e) {
                continue; // Пропустить текущую итерацию цикла и перейти к следующей
            }
        }

    }


}


