<?php

namespace Database\Seeders;

use Exception;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PatternsSeeder extends Seeder
{


    public function __construct()
    {
//        $this->categoriesNumberToInsert = DatabaseSeeder::$categoriesNumberToInsert ?? 10;
//        $this->currentId = DB::table('categories')->max('id') + 1 ?? 1;
    }

    public function run(): void
    {
        $patternsData = [
            ['id' => 1, 'name' => 'Алый'],
            ['id' => 2, 'name' => 'Античная латунь'],
            ['id' => 3, 'name' => 'Античное золото'],
            ['id' => 4, 'name' => 'Апероль'],
            ['id' => 5, 'name' => 'Баклажан'],
            ['id' => 6, 'name' => 'Бежевый'],
            ['id' => 7, 'name' => 'Бело-голубой'],
            ['id' => 8, 'name' => 'Белый'],
            ['id' => 9, 'name' => 'Бесцветный'],
            ['id' => 10, 'name' => 'Бирюзовый'],
            ['id' => 11, 'name' => 'Болотный'],
            ['id' => 12, 'name' => 'Бордо'],
            ['id' => 13, 'name' => 'Бронза'],
            ['id' => 14, 'name' => 'Бронзовый'],
            ['id' => 15, 'name' => 'Голубой'],
            ['id' => 16, 'name' => 'Горошек'],
            ['id' => 17, 'name' => 'Горчичный'],
            ['id' => 18, 'name' => 'Графит'],
            ['id' => 19, 'name' => 'Деним'],
            ['id' => 20, 'name' => 'Дымчатый'],
            ['id' => 21, 'name' => 'Желто-белый'],
            ['id' => 22, 'name' => 'Желтый'],
            ['id' => 23, 'name' => 'Желтый абрикос'],
            ['id' => 24, 'name' => 'Жемчужный'],
            ['id' => 25, 'name' => 'Загорелый'],
            ['id' => 26, 'name' => 'Зеленый'],
            ['id' => 27, 'name' => 'Зенит'],
            ['id' => 28, 'name' => 'Золотой'],
            ['id' => 29, 'name' => 'Изумруд'],
            ['id' => 30, 'name' => 'Исландский синий'],
            ['id' => 31, 'name' => 'Какао'],
            ['id' => 32, 'name' => 'Капучино'],
            ['id' => 33, 'name' => 'Карамель'],
            ['id' => 34, 'name' => 'Кобальт'],
            ['id' => 35, 'name' => 'Корал'],
            ['id' => 36, 'name' => 'Кораллово-розовый'],
            ['id' => 37, 'name' => 'Коричневый'],
            ['id' => 38, 'name' => 'Кофейный'],
            ['id' => 39, 'name' => 'Красный'],
            ['id' => 40, 'name' => 'Кремовый'],
            ['id' => 41, 'name' => 'Кремовый серый'],
            ['id' => 42, 'name' => 'Кэмел'],
            ['id' => 43, 'name' => 'Лавандовый'],
            ['id' => 44, 'name' => 'Лазурный'],
            ['id' => 45, 'name' => 'Латте'],
            ['id' => 46, 'name' => 'Леопард'],
            ['id' => 47, 'name' => 'Лимон'],
            ['id' => 48, 'name' => 'Лососевый'],
            ['id' => 49, 'name' => 'Маки'],
            ['id' => 50, 'name' => 'Малиновый'],
            ['id' => 51, 'name' => 'Мандарин'],
            ['id' => 52, 'name' => 'Марсала'],
            ['id' => 53, 'name' => 'Медный'],
            ['id' => 54, 'name' => 'Медовый'],
            ['id' => 55, 'name' => 'Ментол'],
            ['id' => 56, 'name' => 'Миндальный'],
            ['id' => 57, 'name' => 'Многоцветный'],
            ['id' => 58, 'name' => 'Мокрый асфальт'],
            ['id' => 59, 'name' => 'Молочный'],
            ['id' => 60, 'name' => 'Мята'],
            ['id' => 61, 'name' => 'Небесный'],
            ['id' => 62, 'name' => 'Оливковый'],
            ['id' => 63, 'name' => 'Оранжевый'],
            ['id' => 64, 'name' => 'Пепельный'],
            ['id' => 65, 'name' => 'Персиковый'],
            ['id' => 66, 'name' => 'Песочный'],
            ['id' => 67, 'name' => 'Прозрачный'],
            ['id' => 68, 'name' => 'Пудра'],
            ['id' => 69, 'name' => 'Разноцветный'],
            ['id' => 70, 'name' => 'Рептилия'],
            ['id' => 71, 'name' => 'Розово-серый'],
            ['id' => 72, 'name' => 'Розовый'],
            ['id' => 73, 'name' => 'Сапфировый'],
            ['id' => 74, 'name' => 'Светло розовый'],
            ['id' => 75, 'name' => 'Светло-бежевый'],
            ['id' => 76, 'name' => 'Светло-голубой'],
            ['id' => 77, 'name' => 'Светло-желтый'],
            ['id' => 78, 'name' => 'Светло-зеленый'],
            ['id' => 79, 'name' => 'Светло-серый'],
            ['id' => 80, 'name' => 'Серебро'],
            ['id' => 81, 'name' => 'Серо-бежевый'],
            ['id' => 82, 'name' => 'Серо-белый'],
            ['id' => 83, 'name' => 'Серо-синий'],
            ['id' => 84, 'name' => 'Серый'],
            ['id' => 85, 'name' => 'Сине-белый'],
            ['id' => 86, 'name' => 'Сине-серый'],
            ['id' => 87, 'name' => 'Синий'],
            ['id' => 88, 'name' => 'Синий-нави'],
            ['id' => 89, 'name' => 'Сирень'],
            ['id' => 90, 'name' => 'Сливовый'],
            ['id' => 91, 'name' => 'Слоновая кость'],
            ['id' => 92, 'name' => 'Смальта'],
            ['id' => 93, 'name' => 'Спелая вишня'],
            ['id' => 94, 'name' => 'Телесный'],
            ['id' => 95, 'name' => 'Темно-бежевый'],
            ['id' => 96, 'name' => 'Темно-желтый'],
            ['id' => 97, 'name' => 'Темно-зеленый'],
            ['id' => 98, 'name' => 'Темно-серый'],
            ['id' => 99, 'name' => 'Темно-синий'],
            ['id' => 100, 'name' => 'Темный деним'],
            ['id' => 101, 'name' => 'Терракотовый'],
            ['id' => 102, 'name' => 'Ультрамарин'],
            ['id' => 103, 'name' => 'Фиолетовый'],
            ['id' => 104, 'name' => 'Фисташковый'],
            ['id' => 105, 'name' => 'Фрезовый'],
            ['id' => 106, 'name' => 'Фуксия'],
            ['id' => 107, 'name' => 'Хаки'],
            ['id' => 108, 'name' => 'Цветочно-белый'],
            ['id' => 109, 'name' => 'Чайная роза'],
            ['id' => 110, 'name' => 'Черно-белый'],
            ['id' => 111, 'name' => 'Черно-синий'],
            ['id' => 112, 'name' => 'Черные пятна'],
            ['id' => 113, 'name' => 'Черный'],
            ['id' => 114, 'name' => 'Шоколад'],
            ['id' => 115, 'name' => 'Электро-синий'],
            ['id' => 116, 'name' => 'Янтарный'],
        ];


        foreach ($patternsData as $line) {

            try {
                DB::table('patterns')->insert(
                    [
                        'id' => $line['id'],
                        'name' => $line['name'],
                        'created_at' => now(),
                        'updated_at' => now(),
                    ]
                );
            } catch (Exception $e) {
                continue; // Пропустить текущую итерацию цикла и перейти к следующей
            }
        }

    }


}


